<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0aa685bd9611e9eff08c479ebe54b142c570a112bf5e6d5728573c0b7756ba17","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #805 at https://github.com/cal-itp/data-infra/actions/runs/18545500470","plan_out_hash":"80f1cba198104ea632dde5e2206b48286ab41d891c54fb8312839e6daa42a6ce","plan_hash":"0dd78114630904a693d515ff624b368fa05efd632b127a4c4bb87dd24ce2f306","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "X1xwqg==" -> (known after apply)
!~      detect_md5hash      = "DLLsI9afUYiPOZf7WuKqmg==" -> "different hash"
!~      generation          = 1760473645692716 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "DLLsI9afUYiPOZf7WuKqmg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/audit/fct_bigquery_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "8oQKyQ==" -> (known after apply)
!~      detect_md5hash      = "9Z9rHfKw3TrjHamBf2rxzw==" -> "different hash"
!~      generation          = 1749663118218357 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
!~      md5hash             = "9Z9rHfKw3TrjHamBf2rxzw==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/audit/fct_bigquery_data_access_referenced_tables.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "M4pcng==" -> (known after apply)
!~      detect_md5hash      = "9R3NrBuYzHdL31cZq7MfDQ==" -> "different hash"
!~      generation          = 1749663113923108 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/audit/fct_bigquery_data_access_referenced_tables.sql"
!~      md5hash             = "9R3NrBuYzHdL31cZq7MfDQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/fct_bigquery_data_access_referenced_tables.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "ultxqA==" -> (known after apply)
!~      detect_md5hash      = "uf6n7Bjzg3ahiWtpVDKgRg==" -> "different hash"
!~      generation          = 1755811399257059 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
!~      md5hash             = "uf6n7Bjzg3ahiWtpVDKgRg==" -> (known after apply)
        name                = "data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Ff52Cg==" -> (known after apply)
!~      detect_md5hash      = "J9FN0rPTA5VHVU1qiqHJag==" -> "different hash"
!~      generation          = 1760473647354221 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "J9FN0rPTA5VHVU1qiqHJag==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #805](https://github.com/cal-itp/data-infra/actions/runs/18545500470)